     A          R SIGNONR
     A
     A            USER          10A
     A            LOGDATE       08A
     A            LOGTIME       08A
     A            JOBNAME       10A
     A            RESULT        20A