/* --------------------------------------------------------------- */
/* Programa : BGTUSRCHK                                            */
/* Autor    : Kelvin J. Infante E.                                 */
/* Fecha    : 2026-09-15                                           */
/* Objetivo : Validacion de Usuario - BGTSIGNON                    */
/* Proyecto : BGTSingOn                                            */
/* Version  : 1.0                                                  */
/* --------------------------------------------------------------- */

PGM PARM(&USER &RESULT)

  DCL VAR(&USER) TYPE(*CHAR) LEN(10)
  DCL VAR(&RESULT) TYPE(*CHAR) LEN(1)

  CHGVAR VAR(&RESULT) VALUE('0') /* CHGVAR - Change Variable */

  CHKOBJ OBJ(QSYS/&USER) OBJTYPE(*USRPRF) /* CHKOBJ - Check Objet */

  MONMSG MSGID(CPF9801) EXEC(DO) /* MONMSG - Monitor Message*/

    CHGVAR VAR(&RESULT) VALUE('0')
    RETURN

  ENDDO

  CHGVAR VAR(&RESULT) VALUE('1')

ENDPGM