/* --------------------------------------------------------------- */
/* Programa : SYSNAME                                              */
/* Autor    : Kelvin J. Infante E.                                 */
/* Fecha    : 2026-09-11                                           */
/* Objetivo : Retornar Nombre del sistemas IBM i                   */
/* Proyecto : BGTSIGNON                                            */
/* Version  : 1.0                                                  */
/* --------------------------------------------------------------- */

PGM PARM(&SYSNAME)

  DCL VAR(&SYSNAME) TYPE(*CHAR) LEN(10)

  RTVNETA SYSNAME(&SYSNAME)

ENDPGM